package deu.admi.ac.service;

import java.util.HashMap;
import java.util.List;
import java.util.Map;

import com.nexacro.xapi.data.DataSet;

public interface Ac03Service {


    /*#########################################################################################################################################*/
    /* 일계표(admi/ac/ac03/ac03010.xfdl)                                                                                                       */
    /*#########################################################################################################################################*/

    
    /**
     * 일계표을(를) 조회한다.
     * @param strParam1 파라메타1
     * @param strParam2 파라메타2
     */
    public abstract List<?> selectAc03010MainList(Map map) throws Exception;
    

    /*#########################################################################################################################################*/
    /* 월계표(admi/ac/ac03/ac03020.xfdl)                                                                                                       */
    /*#########################################################################################################################################*/

    
    /**
     * 월계표을(를) 조회한다.
     * @param strParam1 파라메타1
     * @param strParam2 파라메타2
     */
    public abstract List<?> selectAc03020MainList(Map map) throws Exception;
    

    /*#########################################################################################################################################*/
    /* 현금출납부(admi/ac/ac03/ac03030.xfdl)                                                                                                   */
    /*#########################################################################################################################################*/

    
    /**
     * 현금출납부을(를) 조회한다.
     * @param strParam1 파라메타1
     * @param strParam2 파라메타2
     */
    public abstract List<?> selectAc03030MainList(Map map) throws Exception;
    

    /*#########################################################################################################################################*/
    /* 일일수지현황(admi/ac/ac03/ac03040.xfdl)                                                                                                   */
    /*#########################################################################################################################################*/

    
    /**
     * 총계정원장을(를) 조회한다.
     * @param strParam1 파라메타1
     * @param strParam2 파라메타2
     */
    public abstract List<?> selectAc03040MainList(Map map) throws Exception;
    

    /*#########################################################################################################################################*/
    /* 예산대비집행현황(admi/ac/ac03/ac03050.xfdl)                                                                                             */
    /*#########################################################################################################################################*/

    
    /**
     * 예산대비집행현황을(를) 조회한다.
     * @param strParam1 파라메타1
     * @param strParam2 파라메타2
     */
    public abstract List<?> selectAc03050MainList(Map map) throws Exception;
    

    /*#########################################################################################################################################*/
    /* 계좌현황(admi/ac/ac03/ac03060.xfdl)                                                                                                     */
    /*#########################################################################################################################################*/

    
    /**
     * 계좌현황을(를) 조회한다.
     * @param strParam1 파라메타1
     * @param strParam2 파라메타2
     */
    public abstract List<?> selectAc03060MainList(Map map) throws Exception;
    

    /*#########################################################################################################################################*/
    /* 회계마감등록(admi/ac/ac03/ac03070.xfdl)                                                                                                 */
    /*#########################################################################################################################################*/

    
    /**
     * 회계마감등록을(를) 조회한다.
     * @param strParam1 파라메타1
     * @param strParam2 파라메타2
     */
    public abstract List<?> selectAc03070MainList(Map map) throws Exception;
    

    /*#########################################################################################################################################*/
    /* 결산재무제표통계(admi/ac/ac03/ac03080.xfdl)                                                                                             */
    /*#########################################################################################################################################*/

    
    /**
     * 결산재무제표통계을(를) 조회한다.
     * @param strParam1 파라메타1
     * @param strParam2 파라메타2
     */
    public abstract List<?> selectAc03080_10List(Map map) throws Exception;
    
    public abstract List<?> selectAc03080_20List(Map map) throws Exception;
    
    public abstract List<?> selectAc03080_30List(Map map) throws Exception;
    

    /*#########################################################################################################################################*/
    /* 결산부속명세서통계(admi/ac/ac03/ac03090.xfdl)                                                                                           */
    /*#########################################################################################################################################*/

    
    /**
     * 결산부속명세서통계을(를) 조회한다.
     * @param strParam1 파라메타1
     * @param strParam2 파라메타2
     */
    public abstract List<?> selectAc03090MainList(Map map) throws Exception;
    
    /*#########################################################################################################################################*/
    /* 현금및예금명세(admi/ac/ac03/ac03100.xfdl)                                                                                             */
    /*#########################################################################################################################################*/

    /**
     * 현금및예금명세을(를) 조회한다.
     * @param strParam1 파라메타1
     * @param strParam2 파라메타2
     */
    public abstract List<?> selectAc03100MainList(Map map) throws Exception;
    
    /*#########################################################################################################################################*/
    /* 자금원장(admi/ac/ac03/ac03110.xfdl)                                                                                             */
    /*#########################################################################################################################################*/

    /**
     * 자금원장을(를) 조회한다.
     * @param strParam1 파라메타1
     * @param strParam2 파라메타2
     */
    public abstract List<?> selectAc03110MainList(Map map) throws Exception;
    
    /*#########################################################################################################################################*/
    /* 운영원장(admi/ac/ac03/ac03120.xfdl)                                                                                             */
    /*#########################################################################################################################################*/

    /**
     * 운영원장을(를) 조회한다.
     * @param strParam1 파라메타1
     * @param strParam2 파라메타2
     */
    public abstract List<?> selectAc03120MainList(Map map) throws Exception;
    public abstract List<?> selectAc03120MainListMok(Map map) throws Exception;
    public abstract List<?> selectAc03120MainListAfd(Map map) throws Exception;
    
    /*#########################################################################################################################################*/
    /* 미결원장(admi/ac/ac03/ac03130.xfdl)                                                                                             */
    /*#########################################################################################################################################*/

    /**
     * 미결원장을(를) 조회한다.
     * @param strParam1 파라메타1
     * @param strParam2 파라메타2
     */
    public abstract List<?> selectAc03130MainList(Map map) throws Exception;
}
